In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[5,6,np.nan],'B':[7,np.nan,np.nan],'C':[1,2,3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  5.0  7.0  1
1  6.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna()

     A    B  C
0  5.0  7.0  1

In [8]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
df.dropna(thresh=2)

     A    B  C
0  5.0  7.0  1
1  6.0  NaN  2

In [10]:
df.dropna(thresh=2,axis=1)

     A  C
0  5.0  1
1  6.0  2
2  NaN  3

In [11]:
df.fillna(value='Value')

       A      B  C
0      5      7  1
1      6  Value  2
2  Value  Value  3

In [13]:
df['A'].fillna(df['A'].mean(), inplace=True)

In [14]:
df

     A    B  C
0  5.0  7.0  1
1  6.0  NaN  2
2  5.5  NaN  3

In [15]:
df['B'].fillna(df['B'].mean())

0    7.0
1    7.0
2    7.0
Name: B, dtype: float64

In [19]:
df.fillna(df.mean())

     A    B  C
0  5.0  7.0  1
1  6.0  7.0  2
2  5.5  7.0  3

In [32]:
from sklearn.impute import SimpleImputer
imp = SimpleImputer(missing_values=np.nan, strategy='mean')
imp.fit([[3,np.nan,4],[4,5,np.nan],[9,np.nan,8]])

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='mean', verbose=0)

In [33]:
imp.transform(df)

array([[5. , 7. , 1. ],
       [6. , 5. , 2. ],
       [5.5, 5. , 3. ]])